src/openpersonen/templates/request/RequestIngeschrevenPersoon.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
                  xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:gml="http://www.opengis.net/gml">
    <soapenv:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <Timestamp>
                <Created>{{ created }}</Created>
                <Expires>{{ expired }}</Expires>
            </Timestamp>
            {% if username or password %}
                <UsernameToken>
                    {% if username %}
                        <Username>{{ username }}</Username>
                    {% endif %}
                    {% if password %}
                        <Password>{{ password }}</Password>
                    {% endif %}
                </UsernameToken>
            {% endif %}
        </Security>
    </soapenv:Header>
    <soapenv:Body>
        <ns:npsLv01>
            <ns:stuurgegevens>
                <StUF:berichtcode>Lv01</StUF:berichtcode>
                <!--Optional:-->
                <StUF:zender>
                    <!--Optional:-->
                    {% if zender_organisatie %}
                        <StUF:organisatie>{{ zender_organisatie }}</StUF:organisatie>
                    {% endif %}
                    <StUF:applicatie>{{ zender_applicatie }}</StUF:applicatie>
                    <!--Optional:-->
                    {% if zender_administratie %}
                        <StUF:administratie>{{ zender_administratie }}</StUF:administratie>
                    {% endif %}
                    <!--Optional:-->
                    {% if zender_gebruiker %}
                        <StUF:gebruiker>{{ zender_gebruiker }}</StUF:gebruiker>
                    {% endif %}
                </StUF:zender>
                <!--Optional:-->
                <StUF:ontvanger>
                    <!--Optional:-->
                    {% if ontvanger_organisatie %}
                        <StUF:organisatie>{{ ontvanger_organisatie }}</StUF:organisatie>
                    {% endif %}
                    <StUF:applicatie>{{ ontvanger_applicatie }}</StUF:applicatie>
                    <!--Optional:-->
                    {% if ontvanger_administratie %}
                        <StUF:administratie>{{ ontvanger_administratie }}</StUF:administratie>
                    {% endif %}
                    <!--Optional:-->
                    {% if ontvanger_gebruiker %}
                        <StUF:gebruiker>{{ ontvanger_gebruiker }}</StUF:gebruiker>
                    {% endif %}
                </StUF:ontvanger>
                <!--Optional:-->
                <StUF:referentienummer>{{ referentienummer }}</StUF:referentienummer>
                <!--Optional:-->
                <StUF:tijdstipBericht>{{ tijdstip_bericht }}</StUF:tijdstipBericht>
                <StUF:entiteittype>NPS</StUF:entiteittype>
            </ns:stuurgegevens>
            <ns:parameters>
                <StUF:sortering>0</StUF:sortering>
                <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
                <!--Optional:-->
                <StUF:maximumAantal>15</StUF:maximumAantal>
                <!--Optional:-->
                <StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
                <!--Optional:-->
                <StUF:indicatorAantal>false</StUF:indicatorAantal>
            </ns:parameters>
            <!--Optional:-->
            <ns:gelijk StUF:entiteittype="NPS">
                {% if bsn %}
                    <!--Optional:-->
                    <ns:inp.bsn>{{ bsn|escape }}</ns:inp.bsn>
                {% endif %}
                {% if burgerservicenummer %}
                    <!--Optional:-->
                    <ns:inp.bsn>{{ burgerservicenummer|escape }}</ns:inp.bsn>
                {% endif %}
                {% if geboorte__datum %}
                    <!--Optional:-->
                    <ns:geboortedatum StUF:indOnvolledigeDatum="V">
                        {{ geboorte__datum|escape }}
                    </ns:geboortedatum>
                {% endif %}
                {% if geboorte__plaats %}
                    <!--Optional:-->
                    <ns:inp.geboorteplaats>{{ geboorte__plaats|escape }}</ns:inp.geboorteplaats>
                {% endif %}
                {% if geslachtsaanduiding %}
                    <!--Optional:-->
                    <ns:geslachtsaanduiding>{{ geslachtsaanduiding|escape }}</ns:geslachtsaanduiding>
                {% endif %}
                {% if naam__geslachtsnaam %}
                    <!--Optional:-->
                    <ns:geslachtsnaam>{{ naam__geslachtsnaam|escape }}</ns:geslachtsnaam>
                {% endif %}
                {% if naam__voornamen %}
                    <!--Optional:-->
                    <ns:voornamen>{{ naam__voornamen|escape }}</ns:voornamen>
                {% endif %}
                {% if verblijfplaats__gemeentevaninschrijving %}
                    <!--Optional:-->
                    <ns:inp.gemeenteVanInschrijving>
                        {{ verblijfplaats__gemeentevaninschrijving|escape }}
                    </ns:inp.gemeenteVanInschrijving>
                {% endif %}
                {% if naam__voorvoegsel %}
                    <!--Optional:-->
                    <ns:voorvoegselGeslachtsnaam
                    >{{ naam__voorvoegsel|escape }}</ns:voorvoegselGeslachtsnaam>
                {% endif %}
                <!--Optional:-->
                <ns:verblijfsadres>
                    {% if verblijfplaats__huisletter %}
                        <!--Optional:-->
                        <ns:aoa.huisletter>{{ verblijfplaats__huisletter|escape }}</ns:aoa.huisletter>
                    {% endif %}
                    {% if verblijfplaats__huisnummer %}
                        <!--Optional:-->
                        <ns:aoa.huisnummer>{{ verblijfplaats__huisnummer|escape }}</ns:aoa.huisnummer>
                    {% endif %}
                    {% if verblijfplaats__huisnummertoevoeging %}
                        <!--Optional:-->
                        <ns:aoa.huisnummertoevoeging>
                            {{ verblijfplaats__huisnummertoevoeging|escape }}
                        </ns:aoa.huisnummertoevoeging>
                    {% endif %}
                    {% if verblijfplaats__identificatiecodenummeraanduiding %}
                        <!--Optional:-->
                        <ns:aoa.identificatie>
                            {{ verblijfplaats__identificatiecodenummeraanduiding|escape }}
                        </ns:aoa.identificatie>
                    {% endif %}
                    {% if verblijfplaats__postcode %}
                        <!--Optional:-->
                        <ns:aoa.postcode>{{ verblijfplaats__postcode|escape }}</ns:aoa.postcode>
                    {% endif %}
                </ns:verblijfsadres>
            </ns:gelijk>
            <!--Optional:-->
            <ns:scope>
                <ns:object StUF:entiteittype="NPS" StUF:scope="alles"/>
            </ns:scope>
        </ns:npsLv01>
    </soapenv:Body>
</soapenv:Envelope>
